arduino/Arduino/hardware/cc2600emt/cores/cc2600emt/inc/hw_adi.h
//*****************************************************************************
//
// The following are defines for the bit fields in the ADI_O_DIR03 register.
//
//*****************************************************************************
#define ADI_DIR03_B3_M          0xFF000000  // Direct access to ADI register 3
#define ADI_DIR03_B3_S          24
#define ADI_DIR03_B2_M          0x00FF0000  // Direct access to ADI register 2
#define ADI_DIR03_B2_S          16
#define ADI_DIR03_B1_M          0x0000FF00  // Direct access to ADI register 1
#define ADI_DIR03_B1_S          8
#define ADI_DIR03_B0_M          0x000000FF  // Direct access to ADI register 0
#define ADI_DIR03_B0_S          0
//*****************************************************************************
//
// The following are defines for the bit fields in the ADI_O_DIR47 register.
//
//*****************************************************************************
#define ADI_DIR47_B3_M          0xFF000000  // Direct access to ADI register 7
#define ADI_DIR47_B3_S          24
#define ADI_DIR47_B2_M          0x00FF0000  // Direct access to ADI register 6
#define ADI_DIR47_B2_S          16
#define ADI_DIR47_B1_M          0x0000FF00  // Direct access to ADI register 5
#define ADI_DIR47_B1_S          8
#define ADI_DIR47_B0_M          0x000000FF  // Direct access to ADI register 4
#define ADI_DIR47_B0_S          0
//*****************************************************************************
//
// The following are defines for the bit fields in the ADI_O_DIR811 register.
//
//*****************************************************************************
#define ADI_DIR811_B3_M         0xFF000000  // Direct access to ADI register
                                            // 11
#define ADI_DIR811_B3_S         24
#define ADI_DIR811_B2_M         0x00FF0000  // Direct access to ADI register
                                            // 10
#define ADI_DIR811_B2_S         16
#define ADI_DIR811_B1_M         0x0000FF00  // Direct access to ADI register 9
#define ADI_DIR811_B1_S         8
#define ADI_DIR811_B0_M         0x000000FF  // Direct access to ADI register 8
#define ADI_DIR811_B0_S         0
//*****************************************************************************
//
// The following are defines for the bit fields in the ADI_O_DIR1215 register.
//
//*****************************************************************************
#define ADI_DIR1215_B3_M        0xFF000000  // Direct access to ADI register
                                            // 15
#define ADI_DIR1215_B3_S        24
#define ADI_DIR1215_B2_M        0x00FF0000  // Direct access to ADI register
                                            // 14
#define ADI_DIR1215_B2_S        16
#define ADI_DIR1215_B1_M        0x0000FF00  // Direct access to ADI register
                                            // 13
#define ADI_DIR1215_B1_S        8
#define ADI_DIR1215_B0_M        0x000000FF  // Direct access to ADI register
                                            // 12
#define ADI_DIR1215_B0_S        0
//*****************************************************************************
//
// The following are defines for the bit fields in the ADI_O_SET03 register.
//
//*****************************************************************************
#define ADI_SET03_S3_M          0xFF000000  // A high bit value will set the
                                            // corresponding bit in ADI
                                            // register 3. Read returns 0.
#define ADI_SET03_S3_S          24
#define ADI_SET03_S2_M          0x00FF0000  // A high bit value will set the
                                            // corresponding bit in ADI
                                            // register 2. Read returns 0.
#define ADI_SET03_S2_S          16
#define ADI_SET03_S1_M          0x0000FF00  // A high bit value will set the
                                            // corresponding bit in ADI
                                            // register 1. Read returns 0.
#define ADI_SET03_S1_S          8
#define ADI_SET03_S0_M          0x000000FF  // A high bit value will set the
                                            // corresponding bit in ADI
                                            // register 0. Read returns 0.
#define ADI_SET03_S0_S          0
//*****************************************************************************
//
// The following are defines for the bit fields in the ADI_O_SET47 register.
//
//*****************************************************************************
#define ADI_SET47_S3_M          0xFF000000  // A high bit value will set the
                                            // corresponding bit in ADI
                                            // register 7. Read returns 0.
#define ADI_SET47_S3_S          24
#define ADI_SET47_S2_M          0x00FF0000  // A high bit value will set the
                                            // corresponding bit in ADI
                                            // register 6. Read returns 0.
#define ADI_SET47_S2_S          16
#define ADI_SET47_S1_M          0x0000FF00  // A high bit value will set the
                                            // corresponding bit in ADI
                                            // register 5. Read returns 0.
#define ADI_SET47_S1_S          8
#define ADI_SET47_S0_M          0x000000FF  // A high bit value will set the
                                            // corresponding bit in ADI
                                            // register 4. Read returns 0.
#define ADI_SET47_S0_S          0
//*****************************************************************************
//
// The following are defines for the bit fields in the ADI_O_SET811 register.
//
//*****************************************************************************
#define ADI_SET811_S3_M         0xFF000000  // A high bit value will set the
                                            // corresponding bit in ADI
                                            // register 11. Read returns 0.
#define ADI_SET811_S3_S         24
#define ADI_SET811_S2_M         0x00FF0000  // A high bit value will set the
                                            // corresponding bit in ADI
                                            // register 10. Read returns 0.
#define ADI_SET811_S2_S         16
#define ADI_SET811_S1_M         0x0000FF00  // A high bit value will set the
                                            // corresponding bit in ADI
                                            // register 9. Read returns 0.
#define ADI_SET811_S1_S         8
#define ADI_SET811_S0_M         0x000000FF  // A high bit value will set the
                                            // corresponding bit in ADI
                                            // register 8. Read returns 0.
#define ADI_SET811_S0_S         0
//*****************************************************************************
//
// The following are defines for the bit fields in the ADI_O_SET1215 register.
//
//*****************************************************************************
#define ADI_SET1215_S3_M        0xFF000000  // A high bit value will set the
                                            // corresponding bit in ADI
                                            // register 15. Read returns 0.
#define ADI_SET1215_S3_S        24
#define ADI_SET1215_S2_M        0x00FF0000  // A high bit value will set the
                                            // corresponding bit in ADI
                                            // register 14. Read returns 0.
#define ADI_SET1215_S2_S        16
#define ADI_SET1215_S1_M        0x0000FF00  // A high bit value will set the
                                            // corresponding bit in ADI
                                            // register 13. Read returns 0.
#define ADI_SET1215_S1_S        8
#define ADI_SET1215_S0_M        0x000000FF  // A high bit value will set the
                                            // corresponding bit in ADI
                                            // register 12. Read returns 0.
#define ADI_SET1215_S0_S        0
//*****************************************************************************
//
// The following are defines for the bit fields in the ADI_O_CLR03 register.
//
//*****************************************************************************
#define ADI_CLR03_S3_M          0xFF000000  // A high bit value will clear the
                                            // corresponding bit in ADI
                                            // register 3
#define ADI_CLR03_S3_S          24
#define ADI_CLR03_S2_M          0x00FF0000  // A high bit value will clear the
                                            // corresponding bit in ADI
                                            // register 2
#define ADI_CLR03_S2_S          16
#define ADI_CLR03_S1_M          0x0000FF00  // A high bit value will clear the
                                            // corresponding bit in ADI
                                            // register 1
#define ADI_CLR03_S1_S          8
#define ADI_CLR03_S0_M          0x000000FF  // A high bit value will clear the
                                            // corresponding bit in ADI
                                            // register 0
#define ADI_CLR03_S0_S          0
//*****************************************************************************
//
// The following are defines for the bit fields in the ADI_O_CLR47 register.
//
//*****************************************************************************
#define ADI_CLR47_S3_M          0xFF000000  // A high bit value will clear the
                                            // corresponding bit in ADI
                                            // register 7
#define ADI_CLR47_S3_S          24
#define ADI_CLR47_S2_M          0x00FF0000  // A high bit value will clear the
                                            // corresponding bit in ADI
                                            // register 6
#define ADI_CLR47_S2_S          16
#define ADI_CLR47_S1_M          0x0000FF00  // A high bit value will clear the
                                            // corresponding bit in ADI
                                            // register 5
#define ADI_CLR47_S1_S          8
#define ADI_CLR47_S0_M          0x000000FF  // A high bit value will clear the
                                            // corresponding bit in ADI
                                            // register 4
#define ADI_CLR47_S0_S          0
//*****************************************************************************
//
// The following are defines for the bit fields in the ADI_O_CLR811 register.
//
//*****************************************************************************
#define ADI_CLR811_S3_M         0xFF000000  // A high bit value will clear the
                                            // corresponding bit in ADI
                                            // register 11
#define ADI_CLR811_S3_S         24
#define ADI_CLR811_S2_M         0x00FF0000  // A high bit value will clear the
                                            // corresponding bit in ADI
                                            // register 10
#define ADI_CLR811_S2_S         16
#define ADI_CLR811_S1_M         0x0000FF00  // A high bit value will clear the
                                            // corresponding bit in ADI
                                            // register 9
#define ADI_CLR811_S1_S         8
#define ADI_CLR811_S0_M         0x000000FF  // A high bit value will clear the
                                            // corresponding bit in ADI
                                            // register 8
#define ADI_CLR811_S0_S         0
//*****************************************************************************
//
// The following are defines for the bit fields in the ADI_O_CLR1215 register.
//
//*****************************************************************************
#define ADI_CLR1215_S3_M        0xFF000000  // A high bit value will clear the
                                            // corresponding bit in ADI
                                            // register 15
#define ADI_CLR1215_S3_S        24
#define ADI_CLR1215_S2_M        0x00FF0000  // A high bit value will clear the
                                            // corresponding bit in ADI
                                            // register 14
#define ADI_CLR1215_S2_S        16
#define ADI_CLR1215_S1_M        0x0000FF00  // A high bit value will clear the
                                            // corresponding bit in ADI
                                            // register 13
#define ADI_CLR1215_S1_S        8
#define ADI_CLR1215_S0_M        0x000000FF  // A high bit value will clear the
                                            // corresponding bit in ADI
                                            // register 12
#define ADI_CLR1215_S0_S        0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// ADI_O_SLAVESTAT register.
//
//*****************************************************************************
#define ADI_SLAVESTAT_DI_REQ    0x00000002  // Read current value of DI_REQ
                                            // signal. Writing 0 to this bit
                                            // forces a sync with slave,
                                            // ensuring that req will be 0. It
                                            // is recommended to write 0 to
                                            // this register before power down
                                            // of the master.
#define ADI_SLAVESTAT_DI_REQ_M  0x00000002
#define ADI_SLAVESTAT_DI_REQ_S  1
#define ADI_SLAVESTAT_DI_ACK    0x00000001  // Read current value of DI_ACK
                                            // signal
#define ADI_SLAVESTAT_DI_ACK_M  0x00000001
#define ADI_SLAVESTAT_DI_ACK_S  0
//*****************************************************************************
//
// The following are defines for the bit fields in the
// ADI_O_SLAVECONF register.
//
//*****************************************************************************
#define ADI_SLAVECONF_CONFLOCK  0x00000080  // This register is no longer
                                            // accessible when this bit is set.
                                            // (unless sticky_bit_overwrite is
                                            // asserted on top module)
#define ADI_SLAVECONF_CONFLOCK_M \
                                0x00000080
#define ADI_SLAVECONF_CONFLOCK_S 7
#define ADI_SLAVECONF_WAITFORACK \
                                0x00000004  // A transaction on the ADI
                                            // interface does not end until ack
                                            // has been received from the slave
                                            // when this bit is set.

#define ADI_SLAVECONF_WAITFORACK_M \
                                0x00000004
#define ADI_SLAVECONF_WAITFORACK_S 2
#define ADI_SLAVECONF_ADICLKSPEED_M \
                                0x00000003  // Sets the period of an ADI
                                            // transactions. All transactions
                                            // takes an even number of clock
                                            // cycles,- ADI clock rising edge
                                            // occurs in the middle of the
                                            // period. Data and ctrl to slave
                                            // is set up in beginning of cycle,
                                            // and data from slave is read in
                                            // after the transaction 00: An ADI
                                            // transaction takes 2 master clock
                                            // cyclkes 01: An ADI transaction
                                            // takes 4 master clock cycles 10:
                                            // And ADI Transaction takes 8
                                            // master clock cycles 11: An ADI
                                            // transaction takes 16 master
                                            // clock cycles

